## Ejercicios plotly

In [2]:
import numpy as np
import pandas as pd

import plotly # Para ver la versi√≥n
import plotly.express as px

from datetime import datetime

In [3]:
# Versiones

print(f"numpy=={np.__version__}")
print(f"pandas=={pd.__version__}")
print(f"plotly=={plotly.__version__}")

numpy==2.2.0
pandas==2.2.3
plotly==5.24.1

**ref**: _https://www.kaggle.com/datasets/matthieugimbert/french-bakery-daily-sales_

In [4]:
# datasets integrados en plotly:
df = px.data.tips()
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
df = px.data.iris()
df.head()

   sepal_length  sepal_width  petal_length  petal_width species  species_id
0           5.1          3.5           1.4          0.2  setosa           1
1           4.9          3.0           1.4          0.2  setosa           1
2           4.7          3.2           1.3          0.2  setosa           1
3           4.6          3.1           1.5          0.2  setosa           1
4           5.0          3.6           1.4          0.2  setosa           1

In [7]:
df = px.data.gapminder()
df.head()

,country,continent,year,lifeExp,pop,gdpPercap,iso_alpha,iso_num
0,Afghanistan,Asia,1952,28.801,8425333,779.445314,AFG,4
1,Afghanistan,Asia,1957,30.332,9240934,820.853030,AFG,4
2,Afghanistan,Asia,1962,31.997,10267083,853.100710,AFG,4
3,Afghanistan,Asia,1967,34.020,11537966,836.197138,AFG,4
4,Afghanistan,Asia,1972,36.088,13079460,739.981106,AFG,4

### Ejercicio 0:
- Carga el DataFrame **`Bakery sales.csv`**.

In [8]:

df = pd.read_csv('../Data/Bakery sales.csv')
df.head()

,Unnamed: 0,date,time,ticket_number,article,Quantity,unit_price
0,0,2021-01-02,08:38,150040.0,BAGUETTE,1.0,"0,90 ‚Ç¨"
1,1,2021-01-02,08:38,150040.0,PAIN AU CHOCOLAT,3.0,"1,20 ‚Ç¨"
2,4,2021-01-02,09:14,150041.0,PAIN AU CHOCOLAT,2.0,"1,20 ‚Ç¨"
3,5,2021-01-02,09:14,150041.0,PAIN,1.0,"1,15 ‚Ç¨"
4,8,2021-01-02,09:25,150042.0,TRADITIONAL BAGUETTE,5.0,"1,20 ‚Ç¨"

In [9]:
df = pd.read_csv('..\\Data\\Bakery sales.csv')
df.head()

,Unnamed: 0,date,time,ticket_number,article,Quantity,unit_price
0,0,2021-01-02,08:38,150040.0,BAGUETTE,1.0,"0,90 ‚Ç¨"
1,1,2021-01-02,08:38,150040.0,PAIN AU CHOCOLAT,3.0,"1,20 ‚Ç¨"
2,4,2021-01-02,09:14,150041.0,PAIN AU CHOCOLAT,2.0,"1,20 ‚Ç¨"
3,5,2021-01-02,09:14,150041.0,PAIN,1.0,"1,15 ‚Ç¨"
4,8,2021-01-02,09:25,150042.0,TRADITIONAL BAGUETTE,5.0,"1,20 ‚Ç¨"

In [ ]:
# la r permite leer la barra invertida en windows
df = pd.read_csv(r'..\Data\Bakery sales.csv')
df.head()

,Unnamed: 0,date,time,ticket_number,article,Quantity,unit_price
0,0,2021-01-02,08:38,150040.0,BAGUETTE,1.0,"0,90 ‚Ç¨"
1,1,2021-01-02,08:38,150040.0,PAIN AU CHOCOLAT,3.0,"1,20 ‚Ç¨"
2,4,2021-01-02,09:14,150041.0,PAIN AU CHOCOLAT,2.0,"1,20 ‚Ç¨"
3,5,2021-01-02,09:14,150041.0,PAIN,1.0,"1,15 ‚Ç¨"
4,8,2021-01-02,09:25,150042.0,TRADITIONAL BAGUETTE,5.0,"1,20 ‚Ç¨"

### Ejercicio 1:
- Transforma la columna **`unit_price`** a `float`.


- Transforma la columna **`date`** a `datetime`.


- Crea las columnas **`weekday`**, **`month`**, **`year`** y **`hour`**. Las columnas **`weekday`** y **`month`** deben estar representados por nombre, no por n√∫mero.

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234005 entries, 0 to 234004
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     234005 non-null  int64
 1   date           234005 non-null  object
 2   time           234005 non-null  object
 3   ticket_number  234005 non-null  float64
 4   article        234005 non-null  object
 5   Quantity       234005 non-null  float64
 6   unit_price     234005 non-null  object
dtypes: float64(2), int64(1), object(4)
memory usage: 12.5+ MB

In [12]:
df['unit_price']

0         0,90 ‚Ç¨
1         1,20 ‚Ç¨
2         1,20 ‚Ç¨
3         1,15 ‚Ç¨
4         1,20 ‚Ç¨
           ...
234000    0,15 ‚Ç¨
234001    1,20 ‚Ç¨
234002    0,15 ‚Ç¨
234003    1,30 ‚Ç¨
234004    1,30 ‚Ç¨
Name: unit_price, Length: 234005, dtype: object

In [17]:
# uso de apply para quitar ' ‚Ç¨' con una lambda
# reemplazar , por . 
# convertir a float
def formatear_precio(price):
    numerical = price.split(' ')[0] # aqui estariamos separando el numero del euro y nos quedamos con el primer elemento
    numerical_point = numerical.replace(',', '.')
    return float(numerical_point)
df['unit_price'].apply(formatear_precio)

0         0.90
1         1.20
2         1.20
3         1.15
4         1.20
          ...
234000    0.15
234001    1.20
234002    0.15
234003    1.30
234004    1.30
Name: unit_price, Length: 234005, dtype: float64

In [21]:
df.unit_price.str.replace(' ‚Ç¨', '').str.replace(',', '.').astype(np.float32)

0         0.90
1         1.20
2         1.20
3         1.15
4         1.20
          ...
234000    0.15
234001    1.20
234002    0.15
234003    1.30
234004    1.30
Name: unit_price, Length: 234005, dtype: float32

In [22]:
df['unit_price'].str.replace(' ‚Ç¨', '').str.replace(',', '.').astype(np.float32)

0         0.90
1         1.20
2         1.20
3         1.15
4         1.20
          ...
234000    0.15
234001    1.20
234002    0.15
234003    1.30
234004    1.30
Name: unit_price, Length: 234005, dtype: float32

In [23]:
df['unit_price'].apply(lambda price: np.float32(price.split(' ')[0].replace(',', '.')))

0         0.90
1         1.20
2         1.20
3         1.15
4         1.20
          ...
234000    0.15
234001    1.20
234002    0.15
234003    1.30
234004    1.30
Name: unit_price, Length: 234005, dtype: float32

In [26]:
# convertir la fecha a daytime
# datetime.strptime('2021-01-02', '%Y-%m-%d')
df['date'].apply(lambda fecha: datetime.strptime(fecha, '%Y-%m-%d'))
# no es la opcion mas limpia porque pandas ya dispone de un metodo que lo hace

0        2021-01-02
1        2021-01-02
2        2021-01-02
3        2021-01-02
4        2021-01-02
            ...
234000   2022-09-30
234001   2022-09-30
234002   2022-09-30
234003   2022-09-30
234004   2022-09-30
Name: date, Length: 234005, dtype: datetime64[ns]

In [30]:
pd.to_datetime(df['date']) # es el m√©todo de pandas

0        2021-01-02
1        2021-01-02
2        2021-01-02
3        2021-01-02
4        2021-01-02
            ...
234000   2022-09-30
234001   2022-09-30
234002   2022-09-30
234003   2022-09-30
234004   2022-09-30
Name: date, Length: 234005, dtype: datetime64[ns]

In [32]:
df['date'] = df['date'].astype('datetime64[ns]') # es otra manera

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234005 entries, 0 to 234004
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     234005 non-null  int64
 1   date           234005 non-null  datetime64[ns]
 2   time           234005 non-null  object
 3   ticket_number  234005 non-null  float64
 4   article        234005 non-null  object
 5   Quantity       234005 non-null  float64
 6   unit_price     234005 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(3)
memory usage: 12.5+ MB

In [ ]:
# extraer month, weekday, etc:

### Ejercicio 2:

¬øA que hora se venden m√°s productos?

- Grafica un histograma usando la columna de `hour` y `quantity`.
- Agrega el par√°metro `color = year` y `nbins = 48`.
- Haz que el eje X muestre todas las 24 horas del d√≠a.

### Ejercicio 3:
- Repite la gr√°fica anterior, pero quita el filtro por color y separa la gr√°fica en dos, usando el par√°metro `facet_col`.
- Agrega a esa gr√°fica un violin plot usando el par√°metro `marginal`.

### Ejercicio 4:

- Filtra el **DataFrame** por las filas donde la columna `article` tenga la palabra **"BAGUETTE"**.
    - ```html
      df[df["article"].str.contains("")]
      ```
    
- Haz una gr√°fica de **`sunburst`**, separando por a√±o y mes, mostrando la cantidad de elementos vendidos usando el filtro de **"BAGUETTE"**.

### Ejercicio 5:
- Calcula el precio total de cada fila, multiplicando las columnas `quantity` y `unit_price`. Crea una nueva columna `total_article_price` con esta informaci√≥n.

- Elimina las filas donde `quantity` tiene un outlier.

- Haz un violin plot con esa nueva columna.

### Ejercicio 6:
- Agrupa el **DataFrame** por fecha y obten la suma de la columna **`total_article_price`**. Crea un **DataFrame** nuevo.
- Busca la forma de quedarte con la columna **`weekday`** durante la agrupaci√≥n.
- Haz un line plot con este **DataFrame**, utiliza tambi√©n la columna **`weekday`**.

### Ejercicio 7:
- Crea un nuevo DataFrame agrupando por la columna **`ticket_number`**, que tenga como columnas la suma de **`quantity`**, **`total_article_price`** y el maximo de **`year`**. Renombra las columnas.

- Haz un box plot usando la columnas **`quantity`** y **`year`**.

### Ejercicio 8:
- Haz un pie plot mostrando el total vendido por d√≠a de la semana.
- Haz un pie plot mostrando el total vendido por mes.

### Ejercicio 9:
- Agrupa los datos por la columna **`article`** y crea un nuevo DataFrame, donde las columnas sean la suma de **`quantity`** y **`total_article_price`** y la media de **`unit_price`** y el m√≠nimo/m√°ximo de **`year`**.
- Encuentra cuales son los 20 elementos m√°s vendidos y muestralos en un bar plot, usa la columna **`total_article_price`** con el par√°metro `color`.

### Ejercicio 10:
- Usando el DataFrame, crea una nueva columna **`article_new`**, si el art√≠culo de esa fila no est√° entre los 20 m√°s vendidos entonces que tenga el nombre de **`OTRO`**, si el art√≠culo est√° si entre los 20 m√°s vendidos que no se cambie el nombre.

- Repite el bar plot anterior, esta vez usando todas las filas.

### Ejercicio 11:
- Comprueba qu√© relaci√≥n existe entre la cantidad de productos comprados y el precio total del ticket.
- Aplica una transformaci√≥n logar√≠tmica en base 10 al precio y dibuja un box plot para cada cantidad de art√≠culos totales.
- Aseg√∫rate de que, si bien el precio sufre una transformaci√≥n, las anotaciones del plot representen el valor real.

In [ ]:
################################################################################################################################